spec/fixtures/untitled.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><PersonaInsert xmlns="http://tempuri.org/"><Usuario>Administrador</Usuario><Contrasena>#Admin2017</Contrasena><Sucursal>1</Sucursal><Grupo>6</Grupo><NumCliente>620</NumCliente><ApPaterno>JIMENEZ</ApPaterno><ApMaterno>REYES</ApMaterno><Nombre>KARINA</Nombre><RFC xsi:nil="true" /><CURP xsi:nil="true" /><TipoPersona>1</TipoPersona><FechaNac>1965-05-05</FechaNac><Nacionalidad>1</Nacionalidad><Calle>AVENIDA</Calle><NumExterior>15</NumExterior><NumInterior>1</NumInterior><Colonia>CENTRO</Colonia><Localidad>02340009</Localidad><Estado>9</Estado><CP>64000</CP><Pais>1</Pais><Telefono xsi:nil="true" /><Ocupacion>002</Ocupacion><FechaIngreso>2008-01-01</FechaIngreso><Actividad>9411998</Actividad><Genero>M</Genero><PaisDeNacimiento>1</PaisDeNacimiento></PersonaInsert></soap:Body></soap:Envelope>